{"category" : "Skills", "categoryNumber" : 13, "request" : "'But seek first the kingdom of God and his righteousness, and all these things will be added to you.' (Matt. 6:33) Help me to seek first your kingdom Lord and not mine. Give me proper motivation for skill--life, Biblical, and professional--for your kingdom and glory, and the ability to get the skills. Balanced study according to Your will Lord." }
{"category" : "Small Group", "categoryNumber" : 14, "request" : "Doug and Jennifer Ortenzi Small Group - Kim and Rick, Miranda and Justin, Brian and Julie, Scott and Holly, Eric and Famico, Rob and Stephanie, Zach and Emily.  Direction of the topics, discussion, what is done, and who attends. For God to direct who, what, when, why, and where He wants for the group." }
{"category" : "State Government", "categoryNumber" : 15, "request" : "'The king's heart is a stream of water in the hand of the LORD; he turns it wherever he will.' Proverbs 21:1 Kentucky, Ohio, and Indiana Governors, Legislators, State Courts, State Militia, Law Enforcement." }
{"category" : "Individuals", "categoryNumber" : 6, "request" : "Persecuted Church Worldwide, Tyson and Deb Zigler; Teresa and Benjamin Grubbs; Teresa, Johnny and Fran's salvation and relationships. Keith and Mariah Winchester. Mitsu and Kristin Nakamura. That doors open to relationships with international students for the Curd's as well as their leadership abilities and output. For men at Pure Life now, for their hearts and minds to be directed away from the things of this world to you Lord. That the Lord will guard me against fear and help me to meditate  on  His sovereign control over all things--including _______________. That the Lord will enable me to continue to put off self-pity and to put on gratitude.That the Lord will keep me praying for the needs of others and not myself only. For wisdom with present and future commitments. Meditating on His sovereignty has brought such peace. He limits, orders, controls, and knows all about every aspect of our lives. What rich comfort this brings. Job 38:8-11 'Or who shut in the sea with doors, when it burst forth and issued from the womb; when I made the clouds its garment, and thick darkness its swaddling band; when I fixed My limit for it, and set bars and doors; when I said, 'This far you may come, but no farther, and here your proud waves must stop!'" }
{"category" : "Immediate Family", "categoryNumber" : 5, "request" : "Your good hand upon us God; Jackie - glorifying you, health, safety, well being, Your will in her life, and joy. For strength for dealing with life, responsibilities, and me. That she have proper motivations and wisdom; Seth - his salvation and becoming a productive member of society; John & Alyse - John for his intestinal problems; their goals be Biblically motivated and give them wisdom, restraint, foresight in their home and work life; the baby. To grow in their marriage. Motivation for them to do all things to your glory God.; We all need proper selections in what we hear and view. Sophya and her safety and salvation." }
{"categoryNumber" : 7, "category" : "IOUS", "request" : "Inclination toward God and His word - Ps 119:36-37 - 'Incline my heart to your testimonies, and not to selfish gain! Turn my eyes from looking at worthless things; and give me life in your ways.' Opened eyes - Psalm 119:18 - 'Open my eyes, that I may behold wondrous things out of your law.' United heart - Psalm 86:11 - 'Teach me your way, O LORD, that I may walk in your truth; unite my heart to fear your name.' Satisfaction in the Lord - Psalm 90:14 - 'Satisfy us in the morning with your steadfast love, that we may rejoice and be glad all our days.'" }
{"category" : "Neighbors", "categoryNumber" : 12, "request" : "Matt and Kelly, Jack and Kathy, Larry and Diane, Lisa and Mark, Steve and Kate, Rick and family, who will be moving into Lonnie's, Gary and Virgina, George and Bev, Tomia, Chuck, Francois and Angie, and Bill and Joan and their family members. I pray for the salvation, earthly well being and our harmony with them in the neighborhood." }
{"category" : "Church Staff", "categoryNumber" : 1, "request" : "Pastor Brad and his family, Pastor Peter Laruffa and his family, Pastor Bob and his family, Pastor Ken and family, Lee Nordine and family, Todd Richmond and family, Brian Fannin and family, Brad Spence and family, Bob Smith and family, Ryan Fultz and family; Aaron Barnett and family; Admin staff: Rachel, David, Kristina, Kristen, and Lisa; Elders and families: Rob Lohrmann, Roger Patterson, Steve Barnett, and J.D. Rogers. Deacons and families: Steve Lee, Ben Townsend, Jerry Nash, Willie Schadler, Tim Waits, Rique DeWald, Don Price, and Doug Ortenzi . Sunday School Teachers, Worship Team, for the Small Groups and the leaders and what takes place in them. Your will done there God, indeed and always!" }
{"category" : "Me", "categoryNumber" : 10, "request" : "Our Father which art in heaven, teaches me to draw near to You with all holy reverence and confidence, as a child to a Father able and ready to help me and other brothers and sisters; and that I should pray with and for others.\nHallowed be your name, I pray that God would enable me and others to glorify You in all that whereby You make himself known; and that You would dispose all things to Your own glory.\nYour kingdom come, we pray that Satan's kingdom may be destroyed; and that the kingdom of grace may be advanced, ourselves and others brought into it, and kept in it; and that the kingdom of glory may be hastened.\nYour will be done in earth, as it is in heaven, we pray that You, by Your grace, would make me and others able and willing to know, obey and submit to Your will in all things, as the angels do in heaven.\nGive us this day our daily bread, we pray that of Your free gift I and others may receive a competent portion of the good things of this life, and enjoy Your blessing with them.\nAnd forgive us our debts, as we forgive our debtors, we pray that You, for Christ's sake, would freely pardon all our sins; which we are the rather encouraged to ask, because by Your grace we are enabled from the heart to forgive others.\nAnd lead us not into temptation, but deliver us from evil, we pray that You would either keep us from being tempted to sin, or support and deliver us when we are tempted.\nFor Yours is the kingdom, and the power, and the glory, forever, Amen, teaches us to take our encouragement in prayer from You only, and in our prayers to praise You, ascribing kingdom, power and glory to You. And in testimony of our desire, and assurance to be heard, we say, Amen" }
{"category" : "Coworkers", "categoryNumber" : 2, "request" : "Ryan, the testing team, Scott, Adnan, Amol (PWC), xPression team, and other related teams for DocGen; Lynn Richardson, Dan O'Connor, Lance Faig, Brad Snelling, Brad Berding, and Keith Turner; Nolas Team, and other IT Groups;" }
{"category" : "Joshua's Men", "categoryNumber" : 8, "request" : "Eric Heidel, Sean Barry, Hank Pryor, Drew Skjoldal, and Jim Evans" }
{"category" : "World Situation", "categoryNumber" : 16, "request" : "Pray for Christians around the world imprisoned for their faith. Pray God would strengthen, protect and encourage them.\n\nPray God’s protection over pastors and evangelists spreading the gospel message in restricted and hostile nations.\n\nPray God’s provision and encouragement for families of Christians who have been killed for living out their faith in Jesus.\n\nPray government officials in hostile and restricted nations will come to know Jesus Christ personally and follow His will for their lives.\n\nPray for new believers in the Muslim world who are deciding when and how to tell family and friends that they are now followers of Jesus.\n\nPray for radio, television and internet ministries sending God’s Word over and through “closed” borders. Pray the Holy Spirit will bring much fruit for their work.\n\nPray for the provision and safe delivery of Bibles to believers in hostile and restricted nations. \n\nPray God will enable persecuted Christians to witness for Him, even witness to their persecutors. \n\nPray Christians in free nations will understand “the fellowship of suffering” (Phil. 3:10) and choose to stand with and support our persecuted brothers and sisters." }
{"categoryNumber" : 9, "category" : "Local Government", "request" : "'The king's heart is a stream of water in the hand of the LORD; he turns it wherever he will.' Proverbs 21:1 City Managers, Mayors, Council Members, Police, Sheriff and Deputies, Local Courts of Erlanger, Independence, Florence, Edgewood, Crestview Hills, Ft. Mitchell, Ft. Wright, Covington, Newport, Cincinnati, and other local towns.; County Governments of Northern KY, Southwestern OH, and Southeastern IN." }
{"category" : "Extended Family", "categoryNumber" : 3, "request" : "For their salvation as a model of Your grace. If not, then their lives to Your glory; Mom and Jim; Jesse and Cheryl, Josh and Kim ; Dale and Danita, Dustin, Erin; Doug, Garrett, and Benjamin; Rusty and Tim and families; Debbie and Jared; Chris and Tim, Erin; Lori and Mike, C.J., Carlee, Rayder & Eli; Zach and family, Tiff and family, Timmy and family; Mimi at the nursing home and her comfort, Sharon and Eric, Tiffany and Nathan, Kearsten and Trevor, and Family; Becky, Cheryl, Steve and families; Ed and Barb, Rod and Mary Dawn, and Hailey, Scott and Buffy, Tyler, Tanner, Christy; Aunt Carol, Bruce and Betsy, Jonathon and Jamie, and Kaitlyn; Amanda, Donna, Holly, Scott, Craig, and families; Ken, Kristi, Jayson, Sophya, Dameon, Britney, and Lilley." }
{"categoryNumber" : 4, "category" : "Federal Government", "request" : "'The king's heart is a stream of water in the hand of the LORD; he turns it wherever he will.' Proverbs 21:1 President Obama, Vice-President Biden, Cabinet, Dept. Heads, Advisors, Military Leaders and all personnel, Senate, House of Representatives, Supreme Court, Federal Courts." }
{ "_id" : "y39BcBDwSekshurLv", "category" : "Missions", "categoryNumber" : 11, "request" : "This week we’re praying for Blair and Suana Alvidrez who serve in Albania.\n\n \n\nMonday: Counseling. Please pray for us as we continue to counsel. Regularly, we get more requests for help and more Albanians are coming into the counseling room with us to learn. We are involved with one particularly difficult situation. We need wisdom, perseverance, godly perspectives, right attitudes, pure hearts, humility, much grace and mercy, and the power of the Holy Spirit to work “more than” we could hope or imagine.  \n\n \n\nTuesday: Kathyrn’s schooling. As a high schooler (part-time at GDQ, part-time homeschooled), K has many more demanding classes. Please pray for focus and comprehension of materials studied.\n\n \n\nWednesday: Partnership with other US churches. Please pray for clear communication and understanding as to our ministry situation here in Albania. There are many opportunities to come alongside churches and leaders in Albania, so we need wise discernment.\n\n \n\nThursday: Training modules. Praise God with us as those participating in the modules are digging in and internalizing materials taught. It is exciting to witness. Please pray for the planning of next years module training - dates/speakers/topics.\n\n \n\nFriday: Holidays. At this time of year, we miss being with family and friends. Pray that we will be seeking ways to give out to others, especially our neighbors, as to Who Jesus is and why He came. The building we live in is multilingual, so Albanian is not the only language we need to know.   \n\n \n\nSaturday/Sunday: Personally. As we live in the gap between the here and now situations of life and future glory, we want to vibrantly live trusting God more, particularly in the growing threat of terror. Many are frightened here, and it is a wonderful opportunity to bring the good news of the gospel." }
